backend/controllers/AgencyController.php

SELECT * FROM `g_agency` WHERE `id`='30'
UPDATE `g_agency` SET `status`=2 WHERE `id`='30'
---
    public function actionStatus()
    {
        \Yii::$app->response->format = Response::FORMAT_JSON;
        $model = Agency::findOne(\Yii::$app->request->get('id'));
        if(!$model)
            return ['code'=>0,'message'=>'账号不存在!'];
        if($model->status == 1){
            $model->status = 2;
        }elseif($model->status == 2){
            $model->status = 1;
        } elseif($model->status == 4){
            $model->status = 1;
        } else{
            return ['code'=>0,'message'=>'非法操作!'];
        }
        if($model->save())

SELECT * FROM `g_agency` WHERE `id`='30'
---
    public function actionPay()
    {
        $this->layout = false;
        if(empty(\Yii::$app->request->get('id'))){
            $id =  \Yii::$app->request->post('id');
        }else{
            $id =  \Yii::$app->request->get('id');
        }

        $model = Agency::findOne($id);