backend/controllers/PayController.php

    public function actionAgencyPayLog()
    {
        $agency = new Agency();
        $agency->load(\Yii::$app->request->get());
        $agency->initTime();//初始化默认时间
        $model      = '';

        //判断是否输入关键字
        if($agency->keyword != ''){
            $agencyInfo = Agency::find()->where($agency->searchWhere())->one();
            //查询代理是否存在
            if(isset($agencyInfo->id)) {
                $model = AgencyPay::find()->andWhere(['agency_id' => $agencyInfo->id]);
            } else{
                //不存在查询一个不存在代理充值记录
                $model = AgencyPay::find()->where(['id'=>-10]);
            }
        }else {$model = AgencyPay::find();}//没有关键字查询所有
        // 添加查询的时间条件
        $model->andWhere(['>=','time',strtotime($agency->starttime)])->andWhere(['<=','time',strtotime($agency->endtime)]);
        $pages      = new Pagination(['totalCount' =>$model->count(), 'pageSize' => \Yii::$app->params['pageSize']]);
---
SELECT COUNT(*) FROM `g_agency_pay` WHERE (`time` >= 1483200000) AND (`time` <= 1496927807)
SELECT * FROM `g_agency_pay` WHERE (`time` >= 1483200000) AND (`time` <= 1496927807) LIMIT 21