backend/controllers/RebateController.php

    public function actionIndex()
    {
        $agency = new Agency();
        $agency->load(\Yii::$app->request->get());
        $agency->initTime();
        $model      = '';
        if($agency->keyword != ''){
            $agencyInfo = Agency::find()->where($agency->searchWhere())->one();
            if(isset($agencyInfo->id)) $model = Rebate::find()->where(['agency_id'=>$agencyInfo->id]);
                else $model = Rebate::find()->where(['id'=>-10]);
        }else {$model = Rebate::find();}
        $model->andWhere(['>=','time',strtotime($agency->starttime)])->andWhere(['<=','time',strtotime($agency->endtime)]);
        $pages      = new Pagination(['totalCount' =>$model->count(), 'pageSize' => \Yii::$app->params['pageSize']]);
---
SELECT COUNT(*) FROM `g_rebate` WHERE (`time` >= 1483200000) AND (`time` <= 1496927804)
SELECT * FROM `g_rebate` WHERE (`time` >= 1483200000) AND (`time` <= 1496927804) LIMIT 21