backend/controllers/SiteController.php

SELECT * FROM `g_agency_pay` WHERE (`time` > 1496246400) AND (`time` < 1498838399) ORDER BY `time`
---
    public function actionIndex()
    {
        $year       = date('Y');
        $month      = date('m');
        $dayNum     = cal_days_in_month(CAL_GREGORIAN,$month,$year);//算当前月份的天数
        $startTime  = strtotime(($year."-".$month));//算出开始查询的时间戳
        $endTime    = strtotime(($year."-".$month."-".$dayNum." 23:59:59"));//算出结束查询的时间戳
        $orderMonth = [];//平台给代理的充值总金额
        $userOrder  = [];//平台给用户的充值总金额

        /**
         * 算出平台给代理充值的金额
         * 算法思路:
         *      1.查询这个月的所有销售记录
         *      2.循环并累加一个天
         *      3.进入二次循环并判断时间是否为当天、
         *          为当天并unset当前key、此操作为提高程序性能
         */
        $data = AgencyPay::find()->andWhere([">",'time',$startTime])
                                 ->andWhere(["<","time",$endTime])
                                 ->orderBy("time ASC")->asArray()->all();

SELECT * FROM `g_user_pay` WHERE (`time` > 1496246400) AND (`time` < 1498838399) AND (`agency_id`=1) ORDER BY `time`
---
         */
        if(Yii::$app->params['backendPayUser'])
        {
            $data = UserPay::find()->andWhere([">",'time',$startTime])
                                   ->andWhere(["<","time",$endTime])
                                   ->andWhere(['agency_id'=>1])
                                   ->orderBy("time ASC")->asArray()->all();