backend/controllers/UsersController.php

SELECT * FROM `g_users` WHERE `id`='68'
---
    public function actionPay()
    {
        $this->layout = false;
        if(Yii::$app->request->isPost)
        {
            /**
             * 设置返回为json格式
             */
            Yii::$app->response->format = Response::FORMAT_JSON;
            $model = new Users();
            if($model->pay(Yii::$app->request->post()))
            {
                return ['code'=>1,'message'=>Yii::t('app','users_pay_success')];
            }
            /**
             * 获取model返回的错误
             */
            $message = $model->getFirstErrors();
            $message = reset($message);
            return ['code'=>0,'message'=>$message];
        }
        /**
         * 查询用户并返回给页面进行渲染
         */
        $model = Users::findOne(Yii::$app->request->get('id'));