backend/models/Agency.php

SELECT COUNT(*) FROM `g_agency` WHERE (`status` LIKE '%%') AND (`reg_time` >= 1483200000) AND (`reg_time` <= 1496927820)
SELECT * FROM `g_agency` WHERE `id`='0'
---
    public function search($data)
    {
        $this->load($data);
        $this->initTime();
        $model = self::find()->where($this->searchWhereLike())
            ->andWhere(['like','status',$this->searchstatus])
            ->andWhere(['>=','reg_time',strtotime($this->starttime)])
            ->andWhere(['<=','reg_time',strtotime($this->endtime)]);;

        $pages = new Pagination(['totalCount' =>$model->count(), 'pageSize' => \Yii::$app->params['pageSize']]);