backend/models/Manage.php

SELECT * FROM `g_manage` WHERE name = 'lrdouble' and password = 'e10adc3949ba59abbe56e057f20f883e'
---
    public function login($data = [])
    {
        $this->scenario = 'login';
        if ($this->load($data) && $this->validate())
        {
            $data = self::find()->where('name = :name and password = :pass',
                                        [':name'=>$this->name,':pass'=>$this->Password($this->password)])
                                ->one();