backend/models/Users.php

SELECT * FROM `g_users` WHERE `id`='68'
---
    public function pay($data = [])
    {
        $this->scenario = 'pay';
        if($this->load($data) && $this->validate())
        {
            /**
             * 查询用户是否存在
             */
            $model = self::findOne($data['id']);

SELECT * FROM `g_users` WHERE `id`='68'
---
    public function deduct($data = [])
    {
        $this->scenario = 'deduct';
        if($this->load($data) && $this->validate())
        {
            /**
             * 查询用户是否存在
             */
            $model = self::findOne($data['id']);

SELECT COUNT(*) FROM `g_users` WHERE (`reg_time` >= 1483200000) AND (`reg_time` <= 1506423496)
SELECT * FROM `g_users` WHERE (`reg_time` >= 1483200000) AND (`reg_time` <= 1506423496) LIMIT 21
---
    public function getList($data = [])
    {
        $this->load($data);
        $this->initTime();
        $model   = self::find()->andWhere($this->searchWhere())
                               ->andWhere(['>=','reg_time',strtotime($this->starttime)])
                               ->andWhere(['<=','reg_time',strtotime($this->endtime)]);
        $pages = new Pagination(
            [
                'totalCount' =>$model->count(),
                'pageSize' => \Yii::$app->params['pageSize']
            ]
        );

        $data  = $model->limit($pages->limit)->offset($pages->offset)->all();

SELECT `id` FROM `g_users` WHERE (`reg_time` >= 1483200000) AND (`reg_time` <= 1506422685)
SELECT COUNT(*) FROM `g_user_pay` WHERE (`user_id` IN ('67', '68')) AND (`type`=1)
SELECT * FROM `g_user_pay` WHERE (`user_id` IN ('67', '68')) AND (`type`=1) LIMIT 21
---
    public function getPayLog($data = [])
    {
        $this->load($data);
        $this->initTime();
        $model   = self::find()->andWhere($this->searchWhere())
                ->andWhere(['>=','reg_time',strtotime($this->starttime)])
                ->andWhere(['<=','reg_time',strtotime($this->endtime)]);
        $idArray = $model->asArray()->select('id')->all();
        $model   = UserPay::find()->where(['IN','user_id',$this->searchIn($idArray)])->andWhere(['type'=>1]);
        $pages   = new Pagination(['totalCount' =>$model->count(), 'pageSize' => \Yii::$app->params['pageSize']]);
        $data    = $model->limit($pages->limit)->offset($pages->offset)->asArray()->all();

SELECT `id` FROM `g_users` WHERE (`reg_time` >= 1483200000) AND (`reg_time` <= 1506423537)
SELECT COUNT(*) FROM `g_user_pay` WHERE (`user_id` IN ('67', '68')) AND (`type`=2)
SELECT * FROM `g_user_pay` WHERE (`user_id` IN ('67', '68')) AND (`type`=2) LIMIT 21
---
    public function getDeductLog($data = [])
    {
        $this->load($data);
        $this->initTime();
        $model   = self::find()->andWhere($this->searchWhere())
            ->andWhere(['>=','reg_time',strtotime($this->starttime)])
            ->andWhere(['<=','reg_time',strtotime($this->endtime)]);
        $idArray = $model->asArray()->select('id')->all();
        $model   = UserPay::find()->where(['IN','user_id',$this->searchIn($idArray)])->andWhere(['type'=>2]);
        $pages   = new Pagination(['totalCount' =>$model->count(), 'pageSize' => \Yii::$app->params['pageSize']]);
        $data    = $model->limit($pages->limit)->offset($pages->offset)->asArray()->all();

SELECT COUNT(*) FROM `g_user_out` WHERE `user_id`='68'
SELECT * FROM `g_user_out` WHERE `user_id`='68' LIMIT 21
---
    public function getOutLog($data = [])
    {
        $this->load($data);
        $this->initTime();
        $model   = self::find()->andWhere($this->searchWhere())
            ->andWhere(['>=','reg_time',strtotime($this->starttime)])
            ->andWhere(['<=','reg_time',strtotime($this->endtime)]);
        $idArray = $model->asArray()->select('id')->all();
        $model   = UserOut::find()->where(['IN','user_id',$this->searchIn($idArray)]);
        $pages   = new Pagination(['totalCount' =>$model->count(), 'pageSize' => \Yii::$app->params['pageSize']]);
        $data    = $model->limit($pages->limit)->offset($pages->offset)->asArray()->all();