backend/models/Users.php

SELECT `id` FROM `g_users` WHERE (`game_id`='100050') AND (`reg_time` >= 1483200000) AND (`reg_time` <= 1506423693)
---
    public function getWealth($data = [])
    {
        $this->load($data);
        $this->initTime();
        $model   = self::find()->alias('p')->joinWith('gameGold')->andWhere($this->searchWhere())
            ->andWhere(['>=','reg_time',strtotime($this->starttime)])
            ->andWhere(['<=','reg_time',strtotime($this->endtime)])->orderBy('g_users_gold.gold DESC');
        $pages = new Pagination(
            [
                'totalCount' =>$model->count(),
                'pageSize' => \Yii::$app->params['pageSize']
            ]
        );