backend/models/Users.php

SELECT EXISTS(SELECT * FROM `g_users` WHERE (`id`=68))
---
    public function deduct($data = [])
    {
        $this->scenario = 'deduct';
        if($this->load($data) && $this->validate())
        {
            /**
             * 查询用户是否存在
             */
            $model = self::findOne($data['id']);

SELECT `id` FROM `g_users` WHERE (`game_id`='100050') AND (`reg_time` >= 1483200000) AND (`reg_time` <= 1506423714)
SELECT `id` FROM `g_users` WHERE (`game_id`='100050') AND (`reg_time` >= 1483200000) AND (`reg_time` <= 1506423577)
---
    public function getWealth($data = [])
    {
        $this->load($data);
        $this->initTime();
        $model   = self::find()->alias('p')->joinWith('gameGold')->andWhere($this->searchWhere())
            ->andWhere(['>=','reg_time',strtotime($this->starttime)])
            ->andWhere(['<=','reg_time',strtotime($this->endtime)])->orderBy('g_users_gold.gold DESC');
        $pages = new Pagination(
            [
                'totalCount' =>$model->count(),
                'pageSize' => \Yii::$app->params['pageSize']
            ]
        );

        $data  = $model->limit($pages->limit)->offset($pages->offset)->limit('100')->all();