api/models/Users.php

INSERT INTO `g_users` (`game_id`, `nickname`, `gold`, `head`, `reg_time`, `status`, `gold_all`) VALUES (100049, '水电费人温柔温柔', '6', 'http://g.hiphotos.baidu.com/image/pic/item/08f790529822720eb25fa86479cb0a46f31fab9f.jpg', '1506416009', 1, '6')
INSERT INTO `g_users_gold` (`users_id`, `gold_config`, `gold`, `sum_gold`) VALUES (67, '房卡', '0', '0')
---
    public function add($data)
    {
        $this->scenario = 'add';
        if($this->load($data,'') && $this->validate())
        {

            $this->reg_time = time();
            $this->status   = 1;
            $this->gold_all = $this->gold;
            if($this->save())
            {
                $datas = GoldConfigObject::find()->asArray()->all();

                foreach ($datas as $key=>$value)
                {
                    $agencyGold = new UsersGoldObject();
                    $agencyGold->users_id  = $this->id;
                    $agencyGold->gold_config = $value['name'];
                    $agencyGold->gold        = isset($data[$value['en_code']]) ? $data[$value['en_code']] : 0;
                    $agencyGold->sum_gold    = isset($data[$value['en_code']]) ? $data[$value['en_code']] : 0;
                    if($agencyGold->save() == false){